{
    "download_button": "Visualizza versione stampabile",
    "download_file": "Giacomo_Secchi_CV.pdf",
    "language_name": "Italiano",
    "title": "Curriculum Vitae | Giacomo Secchi | Frontend Web Developer",
    "sections": [{
        "title": "Profilo",
        "description": "Professionista \"T-shaped\" con una profonda conoscenza dello sviluppo front-end web e dell'esperienza utente per siti di e-commerce. Sviluppatore di software esperto nel fornire competenze in progettazione, installazione, test e manutenzione di sistemi software. Esperto nell'utilizzo di piattaforme di marketing digitale per aumentare le vendite e la produttività aziendale."
    }, {
        "title": "Professional experience",
        "organizations": [{
            "title": "E-commerce Manager",
            "name": "Francocantiere S.r.l.",
            "date_start": "febbraio 2020",
            "date_end": "presente",
            "description": "Work 360 degree to improve the overall experience of <a href='https://www.francocantiere.it'>Francocantiere</a> e-commerce platform; from Interface to marketing ads and make agreements with local curriers in order to improve the website sales"
        }, {
            "title": "Front-end web developer",
            "name": "YOOX NET-A-PORTER Group",
            "date_start": "giugno 2015",
            "date_end": "febbraio 2020",
            "description": "Create and mantain the interface for some major luxury brands: <a href='https://www.ysl.com/'>YSL</a>, <a href='https://www.stellamccartney.com/'>Stella McCartney</a>, <a href='https://www.therow.com/'>The Row</a>"
        }, {
            "title": "Magento Frontend Developer",
            "name": "MilkyWay S.r.l.",
            "date_start": "maggio 2014",
            "date_end": "giugno 2015",
            "description": "Sviluppo della piattaforma e-commerce www.milkywayshop.it. e del sito corporate milkywaysport.com. Sviluppo e debugging degli elementi frontend dello shop MilkyWay. Sviluppo moduli ed estensioni Magento. Consulenza su UX e design."
        }, {
            "title": "Web Developer",
            "name": "Freelance",
            "date_start": "marzo 2014",
            "date_end": "maggio 2014",
            "description": "Realizzazione sito www.floch.it. Sviluppo blog (WordPress) ed implementazione e-commerce (WooCommerce)."
        },{
            "title": "Web Developer / Programmer",
            "name": "Gruppo Ciemme Srl",
            "date_start": "maggio 2012",
            "date_end": "luglio 2012",
            "description": "Realizzazione siti vetrina e aziendali: dalla proposta grafica al frontend in html e css, creazione struttura layout per template Joomla! CMS. Funzionalità integrate di invio mail, latest tweets e aggiornamento dei contenuti tramite back office Joomla."
        }]
    }, {
        "title": "Competenze tecniche",
        "lists": [
            [
                "CSS/CSS3/LESS/Media queries",
                "JavaScript",
                "HTML5/SVG",
                "Node.js",
                "PHP",
                "ReactJS",
                "Illustrator/Photoshop/Figma",
                "PrestaShop",
                "WP/Gutenberg/WooCommerce"
            ]
        ]
    }, {
        "title": "Studi e Formazione",
        "organizations": [{
            "type": "Educational",
            "name": "Università degli studi di Modena e Reggio Emilia",
            "address": {
                "streetAddress": "Viale Allegri 9",
                "addressLocality": "Reggio Emilia",
                "postalCode": "42121",
                "addressCountry": "IT"
            },
            "course": "Laurea in Scienze della Comunicazione",
            "date_start": "a.a. 2007/2008",
            "date_end": "a.a. 2011/2012",
            "description": "Realizzazione ebooks in formato PDF, esame di Editoria multimediale (30L), Corso per i bibliotecari dell’Università di Modena e Reggio Emilia “Ebook : le caratteristiche, il mercato, l’integrazione in biblioteca”, sviluppo di piccole applicazioni editoriali in codice HTML5. Titolo testi: Riorganizzazione del testo nei libri digitali",
            "link": {
                "text": "Facoltà di Scienze della Comunicazione e dell’Economia",
                "url": "https://www.dce.unimore.it/site/home.html"
            }
        }, {
            "type": "Educational",
            "name": "Adista",
            "address": {
                "streetAddress": "Via Acciaioli 7",
                "addressLocality": "Roma"
            },
            "course": "HTML 5. Un codice per fare tutto. Per editori e giornalisti",
            "date_start": "dicembre 2011",
            "date_end": "marzo 2012",
            "description": "Professional experience description with link",
            "link": {
                "text": "Link 2",
                "url": "https://www.example2.com"
            }
        }]
    }, {
        "title": "Tirocini e stage",
        "organizations": [{
            "title": "Intern Frontend Developer",
            "name": "Caffeina S.r.l.",
            "date_start": "aprile 2013",
            "date_end": "ottobre 2013",
            "description": "Lo stagista entrerà attivamente all'interno del flusso di lavoro aziendale relativo a piccoli progetti, nei quali avrà parte sia nella fase di progettazione che di quella di esecuzione e testing. È stato assegnato allo stagista il ruolo di Frontend Developer orientato ai servizi Web. Ha rafforzato la conoscenza dell'ECMAScript 5+ con particolare attenzione alla cross-compatibilità tra i maggiori browser. \r\n Ha sfruttato noti framework per il DOM Handling (jQuery, Zepto) e per il CSS Scaffolding (Twitter Bootstrap). Ha imparato l'utilizzo delle ultime definizioni degli standard HTML5 e CSS Level 3, utilizzando attivamente alcune delle più moderne API disponibili sui browser di ultima generazione. Ha imparato un meta-linguaggio per il CSS (LESS) che ha avvelocizzato la sua operatività nella definizione degli stili. Ha partecipato attivamente allo sviluppo di applicazioni social-oriented soprattutto relativi alla Facebook Platform. Gli sono state indicate risorse, tutorial, e ha potuto consultare materiale di addestramento aziendale, nonchè si è avvalso, durante tutta la durata dello stage, dell'esperienza diretta dei colleghi."
        }, {
            "title": "Tirocinante",
            "name": "Mister Web S.r.l.",
            "date_start": "dicembre 2010",
            "date_end": "febbraio 2011",
            "description": "conoscere gli aspetti operatvi di un’agenzia di comunicazione che lavora soprattutto per il Web ma si occupa anche di comunicazione a 360° (stampa, soluzioni promozionali, pubblicità ecc.). affiancamento alla resp. uff. marketing nell’attuazione delle operazioni di marketing pianificate (anche tramite CRM) e nella realizzazione dei supporti alla vendita. Affiancamento agli operatori della web agency per lo sviluppo dei progetti, soprattutto web (aggiornamento siti, inserimento contenuti nelle piattaforme CMS, preparazione foto ed immagini, produzione e controllo testi, ecc.)."
        }]
    }, {
        "title": "Languages",
        "lists": [
            [
                "<strong>Italiano</strong>: Nativo",
                "<strong>Inglese</strong>: Fluente (livello B2)"
            ]
        ]
    }]
}